Repository: celerik/celerik-netcore-services
Catalog: source/Celerik.NetCore.Services/Resources/ServiceResources.*.resx
Languages: es

# ApiService.BulkDelete.Error
source: The list of records could not be deleted
es: La lista de registros no pudo ser eliminada

# ApiService.BulkDelete.Success
source: The list of records was successfully deleted!
es: ¡La lista de registros se eliminó exitosamente!

# ApiService.BulkInsert.Error
source: The list of records could not be inserted
es: La lista de registros no pudo ser insertada

# ApiService.BulkInsert.Success
source: The list of records was successfully inserted!
es: ¡La lista de registros se insertó exitosamente!

# ApiService.BulkUpdate.Error
source: The list of records could not be updated
es: La lista de registros no pudo ser actualizada

# ApiService.BulkUpdate.Success
source: The list of records was successfully updated!
es: ¡La lista de registros se actualizó exitosamente!

# ApiService.Delete.Error
source: The record could not be deleted
es: El registro no pudo ser eliminado

# ApiService.Delete.Success
source: The record was successfully deleted!
es: ¡El registro se eliminó exitosamente!

# ApiService.Insert.Error
source: The record could not be inserted
es: El registro no pudo ser insertado

# ApiService.Insert.Success
source: The record was successfully inserted!
es: ¡El registro se insertó exitosamente!

# ApiService.Read.Error
source: The data could not be retrieved
es: Los datos no pudieron ser obtenidos

# ApiService.Update.Error
source: The record could not be updated
es: El registro no pudo ser actualizado

# ApiService.Update.Success
source: The record was successfully updated!
es: ¡El registro se actualizó exitosamente!

# MasterDataService.BlockItem.InvalidMasterDataId
source: The item could no be blocked. 'MasterDataId' with value '{0}' does not exist
es: El ítem no pudo ser bloqueado. 'MasterDataId' con valor '{0}' no existe

# MasterDataService.InsertItem.DuplicatedCode
source: The item could not be inserted. 'Code' with value '{0}' already exists
es: El ítem no pudo ser insertado. El 'Código' con valor '{0}' ya existe

# MasterDataService.InsertItem.DuplicatedDescription
source: The item could not be inserted. 'Description' with value '{0}' already exists
es: El ítem no pudo ser insertado. La 'Descripción' con valor '{0}' ya existe

# MasterDataService.InsertItem.DuplicatedId
source: The item could not be inserted. 'Id' with value '{0}' already exists
es: El ítem no pudo ser insertado. El 'Id' con valor '{0}' ya existe

# MasterDataService.InsertItem.InvalidParentMasterDataId
source: The item could not be inserted. 'ParentMasterDataId' with value '{0}' does not exist
es: El ítem no pudo ser insertado. 'ParentMasterDataId' con valor '{0}' no existe

# MasterDataService.InsertItem.MissingId
source: The item could not be inserted. 'Id' is required
es: El ítem no pudo ser insertado. El 'Id' es requerido

# MasterDataService.InsertItem.UnnecessaryId
source: The item could not be inserted. 'Id' is auto-generated, should not be provided, send null
es: El ítem no pudo ser insertado. El 'Id' es auto-generado, no debe ser proporcionado, especifique null

# MasterDataService.DeleteItem.InvalidMasterDataId
source: The item could not be deleted. 'MasterDataId' with value '{0}' does not exist
es: El ítem no pudo ser eliminado. 'MasterDataId' con valor '{0}' no existe

# MasterDataService.UnblockItem.InvalidMasterDataId
source: The item could not be unblocked. 'MasterDataId' with value '{0}' does not exist
es: El ítem no pudo ser desbloqueado. 'MasterDataId' con valor '{0}' no existe

# MasterDataService.UpdateItem.DuplicatedCode
source: The item could not be updated. 'Code' with value '{0}' already exists
es: El ítem no pudo ser actualizado. El 'Código' con valor '{0}' ya existe

# MasterDataService.UpdateItem.DuplicatedDescription
source: The item could not be updated. 'Description' with value '{0}' already exists
es: El ítem no pudo ser actualizado. La 'Descripción' con valor '{0}' ya existe

# MasterDataService.UpdateItem.DuplicatedId
source: The item could not be updated. 'Id' with value '{0}' already exists
es: El ítem no pudo ser actualizado. El 'Id' con valor '{0}' ya existe

# MasterDataService.UpdateItem.InvalidMasterDataId
source: The item could not be updated. 'MasterDataId' with value '{0}' does not exist
es: El ítem no pudo ser actualizado. 'MasterDataId' con valor '{0}' no existe

# LogService.SearchLogValidator.InvalidLevel
source: Invalid 'Level' filter. Specify one of the following: 'Debug', 'Info', 'Warn', 'Error'
es: El filtro por 'Nivel' es inválido. Especifique uno de los siguientes: 'Debug', 'Info', 'Warn', 'Error'

# SettingService.GetByCategory.InvalidCategory
source: 'Category' with value '{0}' does not exist
es: La 'Categoría' con valor '{0}' no existe

# SettingService.GetByCategoryAndKey.InvalidKategoryKey
source: 'Category' and 'Key' with value '{0}' - '{1}' does not exist
es: La 'Categoría' y 'Clave' con valor '{0}' - '{1}' no existe

# SettingService.GetById.InvalidSettingId
source: 'SettingId' with value '{0}' does not exist
es: 'SettingId' con valor '{0}' no existe

# SettingService.Update.InvalidCategoryKey
source: The setting could not be updated. 'Category' and 'Key' are invalid: '{0}' - '{1}'
es: La configuración no pudo ser actualizada. La 'Categoría' y 'Clave' son inválidas: '{0}' - '{1}'

# SettingService.UpdateById.InvalidId
source: The setting could not be updated. 'SettingId' is invalid: '{0}'
es: La configuración no pudo ser actualizada. 'SettingId' es inválido: '{0}'

# SettingService.UpdateSeveral.InvalidCategoryKey
source: The list of settings could not be updated. Some 'Category' and 'Key' are invalid
es: La lista de configuraciones no pudo ser actualizada. Algunas 'Categoría' y 'Clave' son inválidas

# SettingService.UpdateSeveral.InvalidId
source: The list of settings could not be updated. Some 'SettingId' are invalid
es: La lista de configuraciones no pudo ser actualizada. Algunos 'SettingId' son inválidos

# SettingService.Update.UnallowedUpdate
source: It is not allowed updating this setting
es: No está permitido actualizar esta configuración

# SettingService.Update.UnauthorizedUpdate
source: You are not authorized to update this setting
es: No está autorizado para actualizar esta configuración

# SettingService.Validation.Date
source: Setting '{0}' is invalid. Invalid date format
es: La configuración '{0}' es inválida. Formato de fecha inválido

# SettingService.Validation.Decimals
source: Setting '{0}' is invalid. Max '{1}' decimals allowed, received: '{2}'
es: La configuración '{0}' es inválida. Máx '{1}' decimales permitidos, recibidos: '{2}'

# SettingService.Validation.Double
source: Setting '{0}' is invalid. Expecting a float number
es: La configuración '{0}' es inválida. Se esperaba un número decimal

# SettingService.Validation.Email
source: Setting '{0}' is invalid. Invalid email format
es: La configuración '{0}' es inválida. Se esperaba un formato de correo electrónico

# SettingService.Validation.Integer
source: Setting '{0}' is invalid. Expecting an integer number
es: La configuración '{0}' es inválida. Se esperaba un número entero

# SettingService.Validation.Max
source: Setting '{0}' is invalid. Value should be less or equal than '{1}'
es: La configuración '{0}' es inválida. El valor debe ser menor o igual que '{1}'

# SettingService.Validation.Min
source: Setting '{0}' is invalid. Value should be greater or equal than '{1}'
es: La configuración '{0}' es inválida. El valor debe ser mayor o igual que '{1}'

# SettingService.Validation.Name
source: Setting '{0}' is invalid. Only letters and spaces are allowed
es: La configuración '{0}' es inválida. Sólo son permitidos letras y espacios

# SettingService.Validation.Phone
source: Setting '{0}' is invalid. Expecting a phone with format: '{1}'
es: La configuración '{0}' es inválida. Se esperaba un número de teléfono con formato: '{1}'

# SettingService.Validation.Regex
source: Setting '{0}' is invalid. Expression should follow this format: '{1}'
es: La configuración '{0}' es inválida. Se esperaba una expresión con el siguiente formato: '{1}'

# SettingService.Validation.Required
source: Setting '{0}' is invalid. Value is required
es: La configuración '{0}' es inválida. El valor es requerido

# SettingService.Validation.UnallowedValue
source: Setting '{0}' is invalid. '{1}' is not allowed. Only the following values are allowed: '{2}'
es: La configuración '{0}' es inválida. '{1}' no es permitido. Sólo los sigientes valores están permitidos '{2}'

# SettingService.Validation.Zip
source: Setting '{0}' is invalid. Expected a valid Zip number
es: La configuración '{0}' es inválida. Se esperaba un código postal

# SecurityService.Login.InvalidCredentials
source: User email or password are invalid!
es: ¡El email del usuario o la clave son inválidos!

# SecurityService.UpdateMyLanguage.Unauthorized
source: You are not authorized to update the language
es: No está autorizado para actualizar el lenguaje

# SecurityService.UpdateMyLanguage.InvalidLanguage
source: The language could not be updated. 'LanguageCode' is not supported: '{0}'
es: El lenguaje no pudo ser actualizado. El 'Código de Lenguaje' no está soportado: '{0}'

# SecurityService.UpdateMyLanguage.NothingToUpdate
source: There is nothing to update. The new language is the same as the old one
es: No hay nada que actualizar. El nuevo lenguaje es igual al anterior

# MasterDataService.UpdateItem.UnnecessaryId
source: The item could not be updated. 'Id' is auto-generated, should not be provided, send null
es: El ítem no pudo ser actualizado. El 'Id' es auto-generado, no debe ser proporcionado, especifique null

# MasterDataService.UpdateItem.InvalidOrder
source: The item could not be updated. 'Order' should be between '1' and '{0}'
es: El ítem no pudo ser actualizado. El 'Orden' debe estar entre '1' y '{0}'

# MasterDataService.DeleteItem.ItemWithChildren
source: This item has children and can not be deleted
es: Este ítem tiene hijos y no puede ser eliminado

# MasterDataService.InsertItem.UnallowedInsert
source: It is not allowed inserting children to this item
es: No está permitido insertar hijos a este ítem

# MasterDataService.InsertItem.UnauthorizedInsertOnParent
source: You are not authorized to insert children to this item
es: No está autorizado para insertar hijos a este ítem

# MasterDataService.InsertItem.UnauthorizedInsertOnRoot
source: You are not authorized to insert top level items
es: No está autorizado para insertar ítems de nivel superior

# MasterDataService.UpdateItem.NothingToUpdate
source: There is nothing to update for this item
es: No hay nada para actualizar en este ítem

# MasterDataService.UpdateItem.UnallowedUpdate
source: It is not allowed updating this item
es: No está permitido actualizar este ítem

# MasterDataService.UpdateItem.UnauthorizedUpdate
source: You are not authorized to update this item
es: No está autorizado para actualizar este ítem

# MasterDataService.UpdateItem.UpdateCodeWithReferences
source: This item has references and its 'Code' can not be updated
es: Este ítem tiene referencias y su 'Código' no puede ser actualizado

# MasterDataService.UpdateItem.UpdateIdWithReferences
source: This item has references and its 'Id' can not be updated
es: Este ítem tiene referencias y su 'Id' no puede ser actualizado

# MasterDataService.DeleteItem.UnallowedDelete
source: It is not allowed deleting this item
es: No está permitido eliminar este ítem

# MasterDataService.DeleteItem.UnauthorizedDelete
source: You are not authorized to delete this item
es: No está autorizado para eliminar este ítem

# MasterDataService.GetItem.NoResults
source: There is no item matching the criteria
es: No existe un ítem con el criterio especificado

# MasterDataService.DeleteItem.ItemWithReferences
source: This item has references and can not be deleted
es: Este ítem tiene referencias y no puede ser eliminado

# MasterDataService.InsertItem.MissingCode
source: The item could not be inserted. 'Code' is required
es: El ítem no pudo ser insertado. El 'Código' es requerido

# MasterDataService.InsertItem.UnnecessaryCode
source: The item could not be inserted. 'Code' is auto-generated, should not be provided, send null
es: El ítem no pudo ser insertado. El 'Código' es auto-generado, no debe ser proporcionado, especifique null

# MasterDataService.UpdateItem.UnnecessaryCode
source: The item could not be updated. 'Code' is auto-generated, should not be provided, send null
es: El ítem no pudo ser actualizado. El 'Código' es auto-generado, no debe ser proporcionado, especifique null

# ApiService.Paginate.NoResults
source: There are no records with the specified criteria
es: No hay registros con el criterio especificado
